<template lang="pug">
  link-list(:aboutMe="aboutMe")
</template>

<script>

import LinkList from "../components/LinkList.vue"

export default {
  data () {
    return {
      aboutMe: [
        {
          title: 'Челябинский государственный университет, Институт информационных технологий, Бизнес-информатика',
          text: 'В 2018 году поступил в ЧелГУ на специальность Бизнес-информатика. Тема диссертационной работы связана с предсказанием стоимости жилой недвижимости',
          year: '2018 - наши дни'
        },
        {
          title: 'EasyCode, Online курс Javascript Hero',
          text: 'Прохожу курсы по JavaScript (планирую в ближайшее время начать изучение React)',
          year: '2020 - наши дни'
        },
        {
          title: 'Puzzle English, Метод Тичера',
          text: 'Продолжаю совершенствовать английский с помощью Метода Тичера. Цель к концу 2020 года достигнуть уровня C1',
          year: '2019 - наши дни'
        },
        {
          title: 'Alibra School, Курсы английского языка',
          text: 'Прошел курс skyrocket в школе английского языка. После окончания получил сертификат подтверждающий знания Grammar на уровне B2, а Vocabulary на уровне B1',
          year: '2018 - 2019'
        },
        {
          title: 'ООО Хит Интерьер',
          text: 'Совмещал некие функции project manager и web-development. Нашел для компании дизайнера и, определив потребности руководства, создали с дизайнером макет. Затем я воплотил этот макет с использованием HTML, CSS, и JavaScript. Далее осуществил перенос сайта на cms (wordpress) и подключил необходимые плагины (Concat Form, WP Mail SMTP и др.)',
          year: '2018 - 2019'
        },
        {
          title: 'Российская академия народного хозяйства и государственной службы при Президенте РФ, Экономики и права, Бизнес-информатика',
          text: 'Являлся старостой группы БИо41-14 на протяжении всего обучения. За время учебы участвовал в создании "Кадровой Биржи" и запустил свой проект "Цени момент" (праздничное агентство). Средний балл в дипломе 5.0. Выпускная квалификационная работа на тему "Проектирование и разработка сайта с системой управления контентом (CMS)"',
          year: '2014 - 2018'
        },
        {
          title: 'GeekBrains, Frontend-разработчик',
          text: 'Весной 2017 года решил попробовать глубить свои знания в разработке сайта и наткнулся на компанию GeekBrains. Прошел 1 и 2 уровень HTML,CSS и JavaScript',
          year: '2017 - 2018'
        }
      ]
    }
  },
  methods: {

  },
  components: {
      linkList: LinkList
  }
}
</script>

<style lang="stylus">


</style>
